build/user-settings/host-data/dungeon-name/no-spoilers/general-store.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-28 Sat 10:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Corwin Brust" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org215355d">1. General Store&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DATA">DATA</span></span></a>
<ul>
<li><a href="#org14001ce">1.1. Comestibles :TABLE=comestibles:</a></li>
<li><a href="#orgd6cd93a">1.2. Boozamahol :TABLE=boozamahol:</a></li>
</ul>
</li>
<li><a href="#org909e95b">2. Design</a>
<ul>
<li><a href="#org5259984">2.1. Usage</a></li>
<li><a href="#org834c26b">2.2. Implementation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="CODE">CODE</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
general-store - things to buy
</p>

<p>
The General Store is the only safe place to be, and you can hang-out
here as long as you'd like.  The general store-keep has wares for
purchase (while supplies last) and will sometimes buy your spares
and finds.  The staff isn't chatty and doesn't barter.
</p>

<div id="outline-container-org215355d" class="outline-2">
<h2 id="org215355d"><span class="section-number-2">1</span> General Store&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DATA">DATA</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org14001ce" class="outline-3">
<h3 id="org14001ce"><span class="section-number-3">1.1</span> Comestibles :TABLE=comestibles:</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-left">cheeeze</td>
</tr>

<tr>
<td class="org-right">100</td>
<td class="org-left">cracker-jacks</td>
</tr>

<tr>
<td class="org-right">1k</td>
<td class="org-left">rare cheeeze</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">cheeze food product</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">hard tack</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">organic jerkey sticks</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">dried meat</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">tofu</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">pez</td>
</tr>

<tr>
<td class="org-right">100</td>
<td class="org-left">action figure</td>
</tr>

<tr>
<td class="org-right">75</td>
<td class="org-left">milk</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd6cd93a" class="outline-3">
<h3 id="orgd6cd93a"><span class="section-number-3">1.2</span> Boozamahol :TABLE=boozamahol:</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">1</td>
<td class="org-left">Local imports</td>
</tr>

<tr>
<td class="org-left">10</td>
<td class="org-left">Favorite red</td>
</tr>

<tr>
<td class="org-left">1k</td>
<td class="org-left">(when available) Fine single-malt</td>
</tr>

<tr>
<td class="org-left">10k</td>
<td class="org-left">(when available) Exceptional single-malt</td>
</tr>

<tr>
<td class="org-left">100k</td>
<td class="org-left">(when available) Single-malt of Which We Do Not Speak Aloud</td>
</tr>

<tr>
<td class="org-left">1m</td>
<td class="org-left">Tokay Essencia</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org909e95b" class="outline-2">
<h2 id="org909e95b"><span class="section-number-2">2</span> Design</h2>
<div class="outline-text-2" id="text-2">
<p>
The General Store is a top level table containing no spoilers sorting
item groups by ascending cost.
</p>

<p>
#+name design
</p>
<div class="org-src-container">
<pre class="src src-elisp">
<span style="color: #00FF9C;">(</span>dm-deftable general-store <span style="color: #FF4081;">(</span><span style="color: #00BEFF;">(</span>gold integer <span style="color: #00FFC1;">:label</span> <span style="color: #7FDEFF;">"g"</span><span style="color: #00BEFF;">)</span>
                            <span style="color: #00BEFF;">(</span>item dungeon-item<span style="color: #00BEFF;">)</span><span style="color: #FF4081;">)</span>
  <span style="color: #00FFC1;">:spoilers</span> nil<span style="color: #00FF9C;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org5259984" class="outline-3">
<h3 id="org5259984"><span class="section-number-3">2.1</span> Usage</h3>
<div class="outline-text-3" id="text-2-1">
<p>
#+name usage
</p>
<pre class="example">

;; create/incr items of rcpt-c, deduct cost from payer-c
(general-store-buy dungon-item rcpt-c payer-c)

;; decr/remove item(s) of rcpt-c
(general-store-sell dungeon-item has-c-or-pty payee-c-or-pty)

;; returns cost in gold if the general store has DUNGON-ITEM
(general-store dungeon-item)

;; return the general store table for CATEGORY-STRING if any
(general-store category-string)

;; return the complete set of tables for the general store
(general-store)

</pre>
</div>
</div>

<div id="outline-container-org834c26b" class="outline-3">
<h3 id="org834c26b"><span class="section-number-3">2.2</span> Implementation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="CODE">CODE</span></span></h3>
<div class="outline-text-3" id="text-2-2">
<p>
#+NAME implementation
</p>
<div class="org-src-container">
<pre class="src src-elisp">
<span style="color: #00FF9C;">(</span>def-dungeon-table-fun general-store-buy <span style="color: #FF4081;">(</span>item rcpt-c payer-c<span style="color: #FF4081;">)</span>
  <span style="color: #7FDEFF;">"create/incr items of rcpt-c, deduct cost from payer-c"</span>
  <span style="color: #7f7f7f;">;; </span><span style="color: #CBEBFF; font-style: italic;">do some work right here</span>
  <span style="color: #00FF9C;">)</span>

<span style="color: #00FF9C;">(</span>general-store-sell <span style="color: #FF4081;">(</span>item has-c-or-pty payee-c-or-pty<span style="color: #FF4081;">)</span>
  <span style="color: #7FDEFF;">"Decr/remove item(s) of rcpt-c"</span><span style="color: #00FF9C;">)</span>

<span style="color: #00FF9C;">(</span>general-store <span style="color: #FF4081;">(</span>item<span style="color: #FF4081;">)</span>
  <span style="color: #7FDEFF;">"returns cost in gold if the general store has ITEM"</span><span style="color: #00FF9C;">)</span>

<span style="color: #00FF9C;">(</span>general-store <span style="color: #FF4081;">(</span>category-string<span style="color: #FF4081;">)</span>
  <span style="color: #7FDEFF;">"return the general store table for CATEGORY-STRING if any"</span><span style="color: #00FF9C;">)</span>

<span style="color: #00FF9C;">(</span>general-store <span style="color: #FF4081;">()</span>
  <span style="color: #7FDEFF;">"return the complete set of tables for the general store"</span><span style="color: #00FF9C;">)</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Corwin Brust</p>
<p class="date">Created: 2019-12-28 Sat 10:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
